package streams;

public class Streams {
    /*
      Stream - упорядоченная последовательность данных в виде потока для работы с файлами. Его можно представить как
      канал для обмена данных в большой объеме, где мы можем взаимодействовать с ней. В патеке java.io(IO - Input/Output),
      находятся классы для взаимодействия с разными типами файлов. Файлы разделяют на:
      - Читабельные(text files)
      - Нечитабельные(binary files)
      Поэтому при работе с текстовыми и бинарными файлами, необходимо использовать разные типы стримов, такие как:
      character streams, byte streams.
     */
}
